   #                                                  Titanic Exercise 

   ![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)
   #### Practise Pandas

En primer lugar, importa las bibliotecas necesarias.

In [1]:
import numpy as np
import pandas as pd
import random

### 1. Lee el nombre del archivo y llama a la variable `titanic`.
    - Explora el conjunto de datos `titanic` utilizando `info`, `dtypes` y `describe`.

In [6]:
titanic=pd.read_csv("data/titanic.csv")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [7]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

### 2. Crea un dataframe separado con las columnas `['name', 'sex', 'age']`, llámalo people

Se puede hacer de dos maneras, ¡hazlo de las dos formas!

In [24]:
people=titanic.loc[:,["name","sex","age"]].copy()
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

### 3. Imprime la salida de `people` mostrando las tres primeras filas y las cuatro últimas, utilizando `append`, `tail` y `head`

In [25]:
people.head(3)

                             name     sex    age
0   Allen, Miss. Elisabeth Walton  female  29.00
1  Allison, Master. Hudson Trevor    male   0.92
2    Allison, Miss. Helen Loraine  female   2.00

In [28]:
people.tail(4)

                           name     sex   age
1305      Zabour, Miss. Thamine  female   NaN
1306  Zakarian, Mr. Mapriededer    male  26.5
1307        Zakarian, Mr. Ortin    male  27.0
1308         Zimmerman, Mr. Leo    male  29.0

### 4. Haz slicing la fila del 3 al 9, llámala `s_titanic`.

In [32]:
s_titanic=titanic.iloc[3:10,:].copy()
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

### 5. Haz slicing la fila del 40 al 63 en orden inverso, llámalo `s_titanic_rev`.

In [34]:
s_titanic_rev=titanic.iloc[63:40:1,:].copy()
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

### 6. Haz slicing de las columnas desde la columna inicial hasta `'parch'`, llámalo `left_columns`.

In [37]:
left_columns=titanic.loc[:,:"parch"].copy()
left_columns

,pclass,survived,name,sex,age,sibsp,parch
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2
...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0

### 7. Corta las columnas desde `'name'` hasta `'age'`, llámalo `middle_columns`.

In [40]:
middle_columns=titanic.loc[:,"name":"age"].copy()
middle_columns

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

### 8. Haz slicing de las columnas desde `'ticket'` hasta el final, llámalo `right_columns`.

In [41]:
right_columns=titanic.loc[:,"ticket":].copy()
right_columns

,ticket,fare,cabin,embarked,boat,body,home.dest
0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,315082,7.8750,NaN,S,NaN,NaN,NaN

### 9. ¿Cuál es el nombre de la persona de más edad que murió en el Titanic? ¿Viajaba solo o tenía algún familiar que viajara con él?

In [50]:
max_age=titanic.loc[titanic["survived"]==0]["age"].max()
max_age

74.0

In [51]:
titanic.loc[titanic["age"]==max_age]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.775,NaN,S,NaN,NaN,NaN

In [54]:
titanic.loc[titanic["survived"]==0,["age","parch","sibsp"]].sort_values(by="age",ascending=False)

       age  parch  sibsp
1235  74.0      0      0
9     71.0      0      0
135   71.0      0      0
727   70.5      0      0
506   70.0      0      0
...    ...    ...    ...
1293   NaN      0      0
1297   NaN      0      0
1302   NaN      0      0
1303   NaN      0      0
1305   NaN      0      1

[809 rows x 3 columns]

Para dar una respuesta a la segunda pregunta deberías averiguar qué columnas te dan esa información. Normalmente, parte de tu trabajo como científico de datos será conocer el conjunto de datos con el que estás trabajando. En este caso, las columnas que dan esa información son las siguientes: 
- 'sibsp' Número de hermanos/cónyuges a bordo
- 'parch' Número de padres/hijos a bordo

### 10. Crea la lista de 5 números aleatorios de filas desde 0 hasta el largo del dataframe, llámalo `rows`.

Ej. `rows = [3,7,99,52,48]` usando la librería `random`

In [99]:
rows=np.random.randint(0, len(titanic),5)
rows

array([ 338, 1232,  916,  116, 1080])

Esta lista de números es aleatoria, podría ser diferente.

### 11. Crea la lista de etiquetas de tres columnas, llámala `cols`.

In [100]:
cols=np.random.randint(0, len(titanic.columns),3)
cols

array([12,  7,  6])

### 12. Utiliza ambas listas `rows` y `cols` para crear un nuevo dataframe

In [103]:
df_rand=titanic.iloc[rows,cols].copy()
df_rand

      body           ticket  parch
338    NaN           244358      0
1232   NaN  SOTON/OQ 392089      0
916    NaN           349256      1
116    NaN            19950      4
1080   NaN           368402      0


### 13. Crea un array booleano con la condición de ser mujer u hombre, utilizando la columna `sex`, donde **femenino** es True. Llámalo `array_fe`.

### 14. Cambia el nombre de la columna `"sex"` por `"gender"` y filtra el dataframe `titanic` con el array booleano, llámalo `woman_titanic`.

### 15. ¿Cuántas mujeres eran menores de 18 años? Llama a la variable `menor_wo`

### 16. ¿Cuántas mujeres menores de 18 años murieron realmente? Llama a la variable `dead_wo`

### 17. Eliminar las filas con *Nan* en `titanic` con `how='any'` e imprimir el shape

### 18. Eliminar las filas con *Nan* en `titanic` con `how='all'` e imprimir el shape

### 19. Elimina las columnas de `titanic` con más de 1000 valores perdidos e imprime las columnas restantes

### 20. Calcular la proporción de valores perdidos en la columna `boat`.

### 21.  Agrupa `titanic` por `'pclass` y agrega por las columnas `age` & `fare`, por `max` y `median` y asignalo a `by_class`

### 22. Imprime la edad máxima en cada clase de `by_class`

### 23. Imprime la mediana de la tarifa de cada clase de `by_class`.

### 24. Usando [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) para contar cuántas mujeres u hombres sobrevivieron por clase, llámalo `counted`.

### 25. Añade una nueva columna con la suma de hombres y mujeres supervivientes, llámala `counted['total']`.

### 26. Ordena el `counted` por la columna `total`. ¿En qué clase han sobrevivido más personas?

### 27. Muestra sólo las filas con una máscara con las siguientes condiciones: 
    - Son mujer
    - De tercera clase
    - Menores de 30 años
    - Han sobrevivido
    
    ¿Cuántas filas cumplen la condición?

### 28. Ahora, muestra sólo las filas que utilizan `.loc` con las siguientes condiciones: 
    - Son hombre
    - De primera clase
    - Mayores de 50 años
    - Han muerto
    
    ¿Cuántas filas cumplen la condición?

### 29. Imprime los valores únicos en la columna `'nombre'`

### 30. Encuentra si hubo algún `nombre` repetido en el Titanic.

Pista: Había dos personas con el mismo nombre, ¿quiénes?

### 31. Usando `matplotlib` encuentra la visualización apropiada para mostrar la distribución de la columna `'edad''

In [125]:
import matplotlib.pyplot as plt

### 32. Usando `matplotlib` encuentra el gráfico apropiado para visualizar la columna `'gender'`

32b. ¿Qué pasa si también pintas la columna `'gender'` usando la función [`countplot`](https://seaborn.pydata.org/generated/seaborn.countplot.html) de la librería [`seaborn`](https://seaborn.pydata.org/)?

### 33. Utilizando la función [`catplot`](https://seaborn.pydata.org/generated/seaborn.catplot.html) de la biblioteca `seaborn`, averigua si la hipótesis _"Las mujeres tienen más probabilidades de sobrevivir a los naufragios"_ es cierta o no.

![catplot](./img/catplotgen.png)

### 34. Usando [`kdeplot`]("https://seaborn.pydata.org/generated/seaborn.kdeplot.html") de `seaborn` represente los que no sobrevivieron distribuidos por edad.

Sugerencia: Primero debes "filtrar" el conjunto de datos `titanic` donde la columna "survived" es 0, indexando la columna `"age"` solamente.

Argumentos que debes pasar a la función: 

    - color = "rojo"
    - label = "No sobrevivido"
    - shade = True
    
Deberías obtener algo como esto:

![kdeplot](./img/kdeplotsur.png)